<center>
<img src="../../img/ods_stickers.jpg" />
    
## [mlcourse.ai](https://mlcourse.ai) â€“ Open Machine Learning Course 
Author: Arina Lopukhova (@erynn). Edited by [Yury Kashnitskiy](https://yorko.github.io) (@yorko) and Vadim Shestopalov (@vchulski). This material is subject to the terms and conditions of the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license. Free use is permitted for any non-commercial purpose.

# <center>Assignment #1. Fall 2019
## <center>Exploratory data analysis of Olympic games with Pandas
    
<img src='../../img/olympic_logo.png' width=50%>

Prior to working on the assignment, you'd better check out the corresponding course material:
 - [Exploratory data analysis with Pandas](https://nbviewer.jupyter.org/github/Yorko/mlcourse_open/blob/master/jupyter_english/topic01_pandas_data_analysis/topic1_pandas_data_analysis.ipynb?flush_cache=true), the same as an interactive web-based [Kaggle Kernel](https://www.kaggle.com/kashnitsky/topic-1-exploratory-data-analysis-with-pandas)
 - first lectures in mlcourse.ai [YouTube playlist ](https://www.youtube.com/watch?v=QKTuw4PNOsU&list=PLVlY_7IJCMJeRfZ68eVfEcu-UcN9BbwiX) 
 - you can also practice with demo assignments, which are simpler and already shared with solutions: [A1 demo](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset), [solution](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset-solution)

### Your task is to:
 1. write code and perform computations in the cells below
 2. choose answers in the [webform](https://docs.google.com/forms/d/1JxhQ9Bg4OpM3E5N47ZuRbILgDuMRbvEnUbDMZK8L-NU). Solutions will be shared only with those who've filled in this form 
 3. submit answers with some email and **remember it**! This will be your ID during the course. Specify your real full name in the form as well (no nicks allowed in the final top-100 [rating](https://mlcourse.ai/rating)). If in doubt, you can re-submit the form till the deadline for A1, no problem, but stick to only one email.
 
### <center> Deadline for A1: 2019 September 15, 20:59 GMT (London time)
    
You'll get up to 10 credits for this assignment.

### How to get help
In [ODS Slack](https://opendatascience.slack.com) (if you still don't have access, fill in the [form](https://docs.google.com/forms/d/10HAN5huM996snUKjsNYyT_oOlm2uOsTKulKurb3oiNM/) mentioned on the mlcourse.ai main page), we have a channel **#mlcourse_ai_news** with announcements from the course team.
You can discuss the course content freely in the **#mlcourse_ai** channel (we still have a huge Russian-speaking group, they have a separate channel **#mlcourse_ai_rus**).

Here's how you reply in a thread (press this dialog icon to drill down into a thread):

<img src="../../img/start_a_thread.png" />

Please stick to special threads *a1_q1-5_fall2019* and *a1_q6-10_fall2019* in **#mlcourse_ai_news** for your questions on A1. Help each other without sharing correct code and answers. Our TA **Vadim @vchulski** is there to help (only in the mentioned thread, do not write to him directly).

Lastly, you can save useful messages by pinning them, further you can find pinned items on the top, just below the channel name:

<img src="../../img/pinned_item.png" />

### Assignment 
__There are ten questions about 120 years of Olympic history in this task. Your task is to fill in the missing Python code and choose answers in [this web-form](https://docs.google.com/forms/d/1JxhQ9Bg4OpM3E5N47ZuRbILgDuMRbvEnUbDMZK8L-NU).__

Download the file `athlete_events.csv` from [here](https://drive.google.com/file/d/1f5v6Z2ayc7h698FG_98wP5x1Y2zZQeox/view?usp=sharing) (scraped by [rgriffin](https://www.randigriffin.com/) from www.sports-reference.com). The dataset has the following features:

- __ID__ - Unique number for each athlete
- __Name__ - Athlete's name
- __Sex__ - M or F
- __Age__ - Integer
- __Height__ - In centimeters
- __Weight__ - In kilograms
- __Team__ - Team name
- __NOC__ - National Olympic Committee 3-letter code
- __Games__ - Year and season
- __Year__ - Integer
- __Season__ - Summer or Winter
- __City__ - Host city
- __Sport__ - Sport
- __Event__ - Event
- __Medal__ - Gold, Silver, Bronze, or NA

In [1]:
import pandas as pd

In [6]:
!pwd

/c/data/programming/courses/ods/mlcourse_ai/mlcourse.ai/jupyter_english/assignments_fall2019

In [9]:
# Change the path to the dataset file if needed. 
PATH = '../../data/athlete_events.csv'

In [10]:
data = pd.read_csv(PATH)
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [14]:
len(data), len(data.drop_duplicates())

(271116, 269731)

In [19]:
data[data.Name==' Eleonora Margarida Josephina Scmitt']

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
215054,107953,Eleonora Margarida Josephina Scmitt,F,16.0,NaN,NaN,Brazil,BRA,1948 Summer,1948,Summer,London,Swimming,Swimming Women's 100 metres Freestyle,NaN
215055,107953,Eleonora Margarida Josephina Scmitt,F,16.0,NaN,NaN,Brazil,BRA,1948 Summer,1948,Summer,London,Swimming,Swimming Women's 4 x 100 metres Freestyle Relay,NaN

__1. How old were the youngest male and female participants of the 1992 Olympics?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 16 and 15
- 14 and 13 
- 13 and 11
- 11 and 12

In [12]:
# You code here
data[data.Games.apply(lambda x: '1992' in x)].Games.value_counts()

1992 Summer    12977
1992 Winter     3436
Name: Games, dtype: int64

In [45]:
data[data.Year==1992].groupby('Sex')['Age'].min()

Sex
F    12.0
M    11.0
Name: Age, dtype: float64

In [46]:
# data[data.Games.apply(lambda x: '1992' in x)].groupby('Sex')['Age'].min()

__2. What was the percentage of male basketball players among all the male participants of the 2012 Olympics? Round the answer to the first decimal.__

*Hint:* here and further if needed drop duplicated sportsmen to count only unique ones. 

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 0.2
- 1.5 
- 2.5
- 7.7

In [52]:
data[(data.Sport == 'Basketball') & (data.Sex == 'M') & (data.Year == 2012)].head(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
1186,664,Kieron Robert Achara,M,29.0,208.0,110.0,Great Britain,GBR,2012 Summer,2012,Summer,London,Basketball,Basketball Men's Basketball,NaN
6119,3444,Al-Farouq Ajiede Aminu,M,21.0,211.0,98.0,Nigeria,NGR,2012 Summer,2012,Summer,London,Basketball,Basketball Men's Basketball,NaN

In [71]:
# You code here
data[(data.Sport == 'Basketball') & (data.Sex == 'M') & (data.Year == 2012)].Name.nunique()/data[(data.Sex == 'M') & (data.Year == 2012)].Name.nunique()

0.024581768521679755

__3. What are the mean and standard deviation of height for female tennis players who participated in the 2000 Olympics? Round the answer to the first decimal.__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 171.8 and 6.5
- 179.4 and 10
- 180.7 and 6.7
- 182.4 and 9.1

In [72]:
data[data.Sport.apply(lambda x: 'tennis' in x.lower())].Sport.value_counts()

Tennis          2862
Table Tennis    1955
Name: Sport, dtype: int64

In [76]:
# You code here
data[(data.Sport.apply(lambda x: 'tennis' in x.lower())) & \
     (data.Sex == 'F') & \
     (data.Year == 2000)].Name.nunique(), \
data[(data.Sport.apply(lambda x: 'tennis' in x.lower())) & \
     (data.Sex == 'F') & \
     (data.Year == 2000)].ID.nunique()

(174, 174)

In [74]:
data[(data.Sport.apply(lambda x: 'tennis' in x.lower())) & \
     (data.Sex == 'F') & \
     (data.Year == 2000)].shape

(258, 15)

In [77]:
data[(data.Sport.apply(lambda x: 'tennis' in x.lower())) & \
     (data.Sex == 'F') & \
     (data.Year == 2000)].drop_duplicates(['ID']).describe()

                  ID         Age      Height      Weight    Year
count     174.000000  173.000000  172.000000  172.000000   174.0
mean    76539.971264   24.554913  168.488372   60.029070  2000.0
std     39354.336956    4.652286    7.357606    6.235559     0.0
min       277.000000   17.000000  145.000000   42.000000  2000.0
25%     42905.750000   21.000000  164.000000   56.000000  2000.0
50%     79158.500000   24.000000  168.500000   60.000000  2000.0
75%    112037.000000   28.000000  174.000000   64.000000  2000.0
max    135502.000000   38.000000  191.000000   79.000000  2000.0

In [78]:
data[(data.Sport=='Table Tennis') & \
     (data.Sex == 'F') & \
     (data.Year == 2000)].drop_duplicates(['ID']).describe()

                  ID        Age      Height     Weight    Year
count      85.000000  84.000000   84.000000  84.000000    85.0
mean    77594.376471  25.904762  165.011905  58.285714  2000.0
std     39448.964780   5.354019    6.516881   5.757282     0.0
min       277.000000  17.000000  145.000000  42.000000  2000.0
25%     47867.000000  22.000000  160.000000  54.750000  2000.0
50%     81932.000000  25.500000  165.000000  58.000000  2000.0
75%    113101.000000  30.000000  170.000000  62.000000  2000.0
max    134812.000000  38.000000  181.000000  74.000000  2000.0

In [79]:
data[(data.Sport=='Tennis') & \
     (data.Sex == 'F') & \
     (data.Year == 2000)].drop_duplicates(['ID']).describe()

                  ID        Age      Height     Weight    Year
count      89.000000  89.000000   88.000000  88.000000    89.0
mean    75532.955056  23.280899  171.806818  61.693182  2000.0
std     39460.688296   3.447624    6.563322   6.250256     0.0
min      4723.000000  17.000000  150.000000  52.000000  2000.0
25%     42361.000000  21.000000  168.000000  57.000000  2000.0
50%     75706.000000  24.000000  172.000000  60.000000  2000.0
75%    108845.000000  26.000000  176.000000  65.000000  2000.0
max    135502.000000  30.000000  191.000000  79.000000  2000.0

__4. Find a sportsman who participated in the 2006 Olympics, with the highest weight among other participants of the same Olympics. What sport did he or she do?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- Judo
- Bobsleigh 
- Skeleton
- Boxing

In [83]:
# You code here
data[(data.Year == 2006) & (data.Weight == data[(data.Year == 2006)].Weight.max())]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
8102,4476,Patrick R. Antaki,M,41.0,185.0,127.0,Lebanon,LIB,2006 Winter,2006,Winter,Torino,Skeleton,Skeleton Men's Skeleton,NaN

In [90]:
mw = data[(data.Year == 2006)].Weight.max()
data[(data.Year == 2006)].query(f'Weight == {mw}')

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
8102,4476,Patrick R. Antaki,M,41.0,185.0,127.0,Lebanon,LIB,2006 Winter,2006,Winter,Torino,Skeleton,Skeleton Men's Skeleton,NaN

__5. How many times did John Aalberg participate in the Olympics held in different years?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 0
- 1 
- 2
- 3

In [93]:
# You code here
data[(data.Name == 'John Aalberg')].Games.nunique()

2

In [95]:
data[(data.Name == 'John Aalberg')].drop_duplicates().shape

(8, 15)

__6. How many gold medals in tennis did sportspeople from the Switzerland team win at the 2008 Olympics? Count every medal from every sportsperson.__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- 0
- 1 
- 2
- 3

In [101]:
# You code here
data[(data.Team=='Switzerland') & (data.Year==2008) & (data.Sport=='Tennis') & (data.Medal=='Gold')]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
67290,34396,Roger Federer,M,26.0,185.0,80.0,Switzerland,SUI,2008 Summer,2008,Summer,Beijing,Tennis,Tennis Men's Doubles,Gold
257672,129042,Stanislas Wawrinka,M,23.0,183.0,79.0,Switzerland,SUI,2008 Summer,2008,Summer,Beijing,Tennis,Tennis Men's Doubles,Gold

__7. Is it true that Spain won fewer medals than Italy at the 2016 Olympics? Do not consider NaN values in _Medal_ column.__ 

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- Yes
- No

In [108]:
data[(data.Year==2016) & (data.Team=='Argentina')].shape, \
data[(data.Year==2016) & (data.Team=='Argentina') & ~(data.Medal.isnull())].shape

((228, 15), (22, 15))

In [113]:
# You code here

data[(data.Year==2016)].groupby('Team')['Medal'].count().loc[['Italy', 'Spain'],]

Team
Italy    70
Spain    43
Name: Medal, dtype: int64

In [117]:
pd.options.display.max_rows=500

In [119]:
# data[(data.Year==2016)].groupby('Team')['Medal'].count()

__8. What age category did the fewest and the most participants of the 2008 Olympics belong to?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- [45-55] and [25-35) correspondingly
- [45-55] and [15-25) correspondingly
- [35-45) and [25-35) correspondingly
- [45-55] and [35-45) correspondingly

In [121]:
def add_bins(x):
    if x>=15 and x<25:
        return '15-25'
    elif x>=25 and x<35:
        return '25-35'
    elif x>=35 and x<45:
        return '35-45'
    elif x>=45 and x<=55:
        return '45-55'
    else:
        return 'other'

In [122]:
data_tmp  = data[data.Year==2008].copy()
data_tmp['bin'] = data_tmp.Age.apply(add_bins)

In [123]:
data_tmp.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,bin
79,21,Ragnhild Margrethe Aamodt,F,27.0,163.0,NaN,Norway,NOR,2008 Summer,2008,Summer,Beijing,Handball,Handball Women's Handball,Gold,25-35
136,49,Moonika Aava,F,28.0,168.0,65.0,Estonia,EST,2008 Summer,2008,Summer,Beijing,Athletics,Athletics Women's Javelin Throw,NaN,25-35
159,63,Jos Luis Abajo Gmez,M,30.0,194.0,87.0,Spain,ESP,2008 Summer,2008,Summer,Beijing,Fencing,"Fencing Men's epee, Individual",Bronze,25-35
163,67,Mariya Vasilyevna Abakumova (-Tarabina),F,22.0,179.0,80.0,Russia,RUS,2008 Summer,2008,Summer,Beijing,Athletics,Athletics Women's Javelin Throw,Silver,15-25
167,69,Tamara Abalde Daz,F,19.0,185.0,72.0,Spain,ESP,2008 Summer,2008,Summer,Beijing,Basketball,Basketball Women's Basketball,NaN,15-25

In [126]:
data_tmp.Year.unique()

array([2008], dtype=int64)

In [124]:
# You code here

data_tmp.drop_duplicates().groupby('bin').size()

bin
15-25    6294
25-35    6367
35-45     790
45-55     119
other      32
dtype: int64

In [125]:
data_tmp.drop_duplicates().groupby('bin').ID.nunique()

bin
15-25    4786
25-35    5382
35-45     630
45-55      78
other      23
Name: ID, dtype: int64

In [138]:
data_tmp.drop_duplicates().groupby('bin').ID.nunique().sum()

10899

__9. Is it true that there were Summer Olympics held in Atlanta? Is it true that there were Winter Olympics held in Squaw Valley?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- Yes, Yes
- Yes, No
- No, Yes 
- No, No

In [131]:
# You code here
data[data.City=='Atlanta'].Season.value_counts()

Summer    13780
Name: Season, dtype: int64

In [130]:
data[data.City=='Squaw Valley'].Season.value_counts()

Winter    1116
Name: Season, dtype: int64

__10. What is the absolute difference between the number of unique sports at the 1986 Olympics and 2002 Olympics?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- 3 
- 10
- 15
- 27

In [132]:
# You code here
data[data.Year==1986].Sport.unique()

array([], dtype=object)

In [135]:
data[data.Year==2002].Sport.unique()

array(['Ice Hockey', 'Alpine Skiing', 'Cross Country Skiing', 'Luge',
       'Freestyle Skiing', 'Speed Skating', 'Figure Skating',
       'Nordic Combined', 'Bobsleigh', 'Ski Jumping', 'Biathlon',
       'Skeleton', 'Short Track Speed Skating', 'Snowboarding', 'Curling'],
      dtype=object)

In [136]:
data[data.Year==2002].Sport.nunique()

15

In [137]:
sorted(data.Year.unique())

[1896,
 1900,
 1904,
 1906,
 1908,
 1912,
 1920,
 1924,
 1928,
 1932,
 1936,
 1948,
 1952,
 1956,
 1960,
 1964,
 1968,
 1972,
 1976,
 1980,
 1984,
 1988,
 1992,
 1994,
 1996,
 1998,
 2000,
 2002,
 2004,
 2006,
 2008,
 2010,
 2012,
 2014,
 2016]

That's it! Now go and do 30 push-ups! :)